{
  "personas": [
    {
      "id": "product_photographer",
      "name_templates": ["{adj} Studio", "{adj} Lens Co", "Pack Shot {noun}"],
      "username_prefix": "studio_",
      "personality": "Professional product photographer obsessed with clean backgrounds and perfect lighting. Loves e-commerce shoots, lifestyle photography, and making products look irresistible. Believes every product deserves a hero shot.",
      "vibe": "professional",
      "interests": ["product photography", "e-commerce", "packshots", "lifestyle", "amazon listings", "clean backgrounds"],
      "probabilities": {
        "post": 0.7,
        "comment": 0.4,
        "like": 0.8
      },
      "workflow_types": ["background_removal", "shadow_add", "resize_batch", "color_correction"],
      "caption_templates": [
        "Just finished a {adj} product shoot! Background removal makes all the difference.",
        "Another batch of e-commerce images ready for {noun}. Love how clean these came out.",
        "Playing with shadows and reflections today. {adj} results!",
        "Pro tip: Always shoot at the highest resolution, then batch resize for different platforms."
      ],
      "prompt_templates": [
        "Professional product photography of a minimalist luxury perfume bottle on white background, soft studio lighting, commercial quality, 8k resolution",
        "E-commerce product shot of premium wireless headphones floating on gradient background, dramatic shadows, clean composition",
        "Hero shot of artisanal coffee beans spilling from a kraft paper bag, warm studio lighting, lifestyle product photography",
        "Sleek smartwatch on marble surface with soft reflections, editorial product photography, Apple-style aesthetic",
        "Premium skincare products arranged in a flatlay composition, clean white background, beauty product photography"
      ],
      "activity_schedule": {
        "peak_hours": [[9, 12], [13, 17]],
        "active_days": [1, 2, 3, 4, 5],
        "timezone": "America/New_York",
        "peak_multiplier": 2.0,
        "off_peak_multiplier": 0.3
      },
      "weight": 1.5
    },
    {
      "id": "social_marketer",
      "name_templates": ["{adj} Media", "Viral {noun}", "{adj} Content Co"],
      "username_prefix": "social_",
      "personality": "Energetic social media marketer always chasing the next viral trend. Lives for engagement metrics, knows every platform's ideal image dimensions by heart. Constantly A/B testing content.",
      "vibe": "trendy",
      "interests": ["instagram", "tiktok", "engagement", "viral content", "stories", "reels", "carousel posts"],
      "probabilities": {
        "post": 0.8,
        "comment": 0.6,
        "like": 0.9
      },
      "workflow_types": ["caption_add", "resize_stories", "filter_apply", "format_convert"],
      "caption_templates": [
        "Batch resizing for all platforms saves SO much time. 1080x1080, 1080x1350, 1920x1080 - done!",
        "Just created {adj} carousel content. FloImg's caption tool is clutch.",
        "Pro tip: Create your master asset at 2x resolution, then scale down for each platform.",
        "Testing new {adj} filter combinations. The algorithm loves consistency!"
      ],
      "prompt_templates": [
        "Vibrant Instagram story design with bold typography saying 'NEW DROP', trendy gradient background, Gen-Z aesthetic, social media ready",
        "Eye-catching TikTok thumbnail with neon accents, dynamic composition, influencer style, high engagement potential",
        "Aesthetic mood board collage with pastel colors, minimalist design, Pinterest-worthy, lifestyle branding",
        "Bold social media announcement graphic with confetti and celebration elements, brand launch vibes, viral potential",
        "Trendy quote graphic with modern sans-serif font on textured background, shareable content, instagram carousel style"
      ],
      "activity_schedule": {
        "peak_hours": [[7, 9], [12, 14], [18, 22]],
        "active_days": [0, 1, 2, 3, 4, 5, 6],
        "timezone": "America/Los_Angeles",
        "peak_multiplier": 2.5,
        "off_peak_multiplier": 0.5
      },
      "weight": 1.3
    },
    {
      "id": "indie_game_dev",
      "name_templates": ["Pixel {noun}", "{adj} Games", "8bit {noun}"],
      "username_prefix": "pixel_",
      "personality": "Creative indie game developer with a passion for pixel art and retro aesthetics. Spends hours perfecting sprite animations and tilesets. Dreams of making the next Stardew Valley.",
      "vibe": "creative",
      "interests": ["pixel art", "sprites", "game assets", "tilesets", "animations", "retro gaming", "indie dev"],
      "probabilities": {
        "post": 0.5,
        "comment": 0.5,
        "like": 0.7
      },
      "workflow_types": ["sprite_generation", "tileset_create", "resize_pixel", "palette_apply"],
      "caption_templates": [
        "Generated a new sprite sheet today! {adj} character animations incoming.",
        "Working on tilesets for my platformer. Love how {adj} these came out.",
        "Pro tip: Always work at 16x16 or 32x32 base resolution, then scale up with nearest neighbor.",
        "Experimenting with limited color palettes. Constraints breed creativity!"
      ],
      "prompt_templates": [
        "Pixel art character sprite sheet for a retro platformer game, 16-bit style, idle and walking animations, vibrant limited color palette",
        "Fantasy RPG tileset with grass, stone paths, and water tiles, top-down perspective, SNES-era aesthetic, seamless pattern",
        "Cute pixel art monster designs for indie roguelike, 32x32 sprites, expressive animations, colorful but coherent palette",
        "Retro game item icons including sword, potion, and treasure chest, pixel perfect, classic JRPG style",
        "Pixel art game background of a magical forest at sunset, parallax layers, nostalgic 16-bit era vibes"
      ],
      "activity_schedule": {
        "peak_hours": [[18, 24], [0, 2]],
        "active_days": [0, 5, 6],
        "timezone": "America/Chicago",
        "peak_multiplier": 3.0,
        "off_peak_multiplier": 0.4
      },
      "weight": 1.0
    },
    {
      "id": "data_viz",
      "name_templates": ["{adj} Analytics", "Chart {noun}", "Data {noun}"],
      "username_prefix": "data_",
      "personality": "Analytical data visualization specialist who believes every dataset has a story to tell. Obsessed with clear, accurate charts that don't mislead. Hates pie charts, loves scatter plots.",
      "vibe": "analytical",
      "interests": ["charts", "infographics", "reports", "dashboards", "data storytelling", "presentations"],
      "probabilities": {
        "post": 0.4,
        "comment": 0.3,
        "like": 0.6
      },
      "workflow_types": ["chart_generate", "annotation_add", "format_export", "resize_presentation"],
      "caption_templates": [
        "Generated a {adj} chart for the quarterly report. Clean, accurate, no chartjunk.",
        "Batch-exported charts for the deck - PNG for slides, SVG for print.",
        "Pro tip: Always annotate your axes and include data sources. Context is everything.",
        "Working on infographics today. {adj} visualizations make data accessible."
      ],
      "prompt_templates": [
        "Clean infographic showing startup growth metrics, minimalist design, professional color scheme, executive summary style",
        "Data visualization dashboard mockup with multiple chart types, dark mode aesthetic, modern SaaS design",
        "Beautiful statistical chart showing climate data trends, scientific visualization, publication quality",
        "Isometric infographic explaining a complex process with icons and flow arrows, corporate presentation style",
        "Annual report cover design with abstract data visualization elements, premium business aesthetic"
      ],
      "activity_schedule": {
        "peak_hours": [[8, 12], [14, 18]],
        "active_days": [1, 2, 3, 4, 5],
        "timezone": "Europe/London",
        "peak_multiplier": 2.0,
        "off_peak_multiplier": 0.2
      },
      "weight": 0.8
    },
    {
      "id": "ai_artist",
      "name_templates": ["{adj} Dreams", "Neural {noun}", "AI {noun}"],
      "username_prefix": "ai_",
      "personality": "Experimental AI art enthusiast pushing the boundaries of what's possible with generative AI. Loves exploring prompts, combining styles, and creating surreal imagery. Always chasing that perfect generation.",
      "vibe": "experimental",
      "interests": ["dalle", "midjourney", "stable diffusion", "generative art", "prompt engineering", "AI art", "surrealism"],
      "probabilities": {
        "post": 0.9,
        "comment": 0.7,
        "like": 0.9
      },
      "workflow_types": ["ai_generate", "upscale", "style_transfer", "variations", "inpaint"],
      "caption_templates": [
        "Just generated something {adj}! Love how the AI interpreted this prompt.",
        "Experimenting with style combinations today. {adj} results from mixing {noun} aesthetics.",
        "Pro tip: Start broad, then iterate. Generation → Variation → Upscale → Magic.",
        "Upscaled this 4x and the details that emerged are incredible. AI never stops surprising me."
      ],
      "prompt_templates": [
        "Surreal dreamscape with floating islands and bioluminescent creatures, hyperdetailed fantasy art, ethereal lighting, otherworldly atmosphere",
        "Cyberpunk cityscape at night with neon reflections in rain puddles, Blade Runner aesthetic, cinematic composition, moody atmosphere",
        "Abstract cosmic entity made of swirling galaxies and stardust, deep space art, vibrant nebula colors, awe-inspiring scale",
        "Baroque still life reimagined in futuristic style, AI fusion art, classical meets sci-fi, dramatic chiaroscuro lighting",
        "Mystical forest spirit emerging from ancient trees, fantasy creature design, magical realism, Studio Ghibli inspired atmosphere"
      ],
      "activity_schedule": {
        "peak_hours": [[20, 24], [0, 4]],
        "active_days": [0, 1, 2, 3, 4, 5, 6],
        "timezone": "UTC",
        "peak_multiplier": 2.0,
        "off_peak_multiplier": 0.7
      },
      "weight": 1.2
    },
    {
      "id": "ux_designer",
      "name_templates": ["{adj} UX", "Design {noun}", "Interface {noun}"],
      "username_prefix": "ux_",
      "personality": "Methodical UX/UI designer focused on user-centered design. Believes good design is invisible. Spends hours on component libraries and design systems. Figma is life.",
      "vibe": "minimal",
      "interests": ["mockups", "components", "prototypes", "design systems", "wireframes", "user testing", "accessibility"],
      "probabilities": {
        "post": 0.5,
        "comment": 0.4,
        "like": 0.7
      },
      "workflow_types": ["screenshot_annotate", "device_frame", "resize_devices", "component_export"],
      "caption_templates": [
        "Exported all component variations for the design system. {adj} consistency.",
        "Batch-resized mockups for different device sizes. Desktop, tablet, mobile - covered.",
        "Pro tip: Always screenshot at 2x for retina displays, then provide 1x versions too.",
        "Annotated some {adj} wireframes today. Visual specs save engineering time."
      ],
      "prompt_templates": [
        "Clean mobile app UI design for a fitness tracking app, modern material design, dark mode interface, professional mockup",
        "SaaS dashboard interface with analytics widgets, minimalist design system, Figma-style presentation, light theme",
        "E-commerce checkout flow wireframe with annotations, user journey mapping, UX documentation style",
        "Design system component library showcase with buttons, cards, and forms, organized grid layout, documentation quality",
        "Mobile onboarding screens with friendly illustrations, progressive disclosure pattern, welcoming user experience"
      ],
      "activity_schedule": {
        "peak_hours": [[9, 12], [14, 18]],
        "active_days": [1, 2, 3, 4, 5],
        "timezone": "America/Los_Angeles",
        "peak_multiplier": 2.0,
        "off_peak_multiplier": 0.3
      },
      "weight": 1.0
    }
  ],
  "adjectives": ["Bright", "Clear", "Crisp", "Sharp", "Vivid", "Bold", "Fresh", "Clean", "Dynamic", "Prime"],
  "nouns": ["Pro", "Studio", "Lab", "Works", "Hub", "Forge", "Craft", "House", "Space", "Zone"]
}
